app/Controllers/Gegenstand.php

SELECT *
FROM `hat_schaden`
WHERE `gegenstand_id` = 'GEa'
AND `bezeichnung` = 'brüchig'
---
    public function schadenHinzufuegen($gegenstandId = false, $schaden = false)
    {
        if($gegenstandId == false)
        {
            return view('errors/html/error_404');
        }

        $data['page_title'] = "Schaden hinzufügen";
        $data['menuName'] = "gegenstand";

        $data['gegenstandId'] = $gegenstandId;

        if($schaden != false)
        {
            $schadenM = new SchadenModel();
            $schadenDb = $schadenM->where('bezeichnung', $schaden)->Find();