app/Libraries/GegenstandHelper.php

SELECT *
FROM `gegenstand`
---
    public static function getAll()
    {
        $gegenstandModel = new GegenstandModel();
        $gegenstand = $gegenstandModel->FindAll();

INSERT INTO `gegenstand` (`gegenstand_id`, `bezeichnung`) VALUES ('GEAb', '/')
---
    public static function add($id, $bezeichnung)
    {
        $data = [
            'gegenstand_id' => $id,
            'bezeichnung' => $bezeichnung
        ];

        $gegenstandModel = new GegenstandModel();

        // Inserts data and returns inserted row's primary key
        $gegenstandDbId = $gegenstandModel->insert($data);

SELECT *
FROM `gegenstand`
WHERE `gegenstand_id` = 'GEAb'
 LIMIT 1
---
    public static function getById($id)
    {
        $gegenstandModel = new GegenstandModel();
        $gegenstand = $gegenstandModel->where("gegenstand_id", $id)->First();

DELETE FROM `gegenstand`
WHERE `gegenstand_id` IN ('GEasdf')
---
    public static function deleteGegenstand($id)
    {
        $gegenstandModel = new GegenstandModel();
        $gegenstandModel->delete($id);