app/Libraries/LeihtHelper.php

SELECT *
FROM `leiht`
WHERE `id` = '9'
 LIMIT 1
---
    public static function getById($id)
    {
        $leihtModel = new LeihtModel();
        $leiht = $leihtModel->where("id", $id)->First();

SELECT *
FROM `leiht`
WHERE `aktiv` = 1
ORDER BY `datum_start` DESC
---
    public static function getActiveDesc()
    {
        $leihtModel = new LeihtModel();

        $leiht = $leihtModel->where("aktiv", 1)->orderBy("datum_start", "DESC")->FindAll();