app/Libraries/LeihtHelper.php

    public static function add($schueler_id, $gegenstand_id, $datum_start = false, $datum_ende = false, $weitere = false, $aktiv = 1)
    {
        $datumStart = $datum_start;
        $datumEnde = $datum_ende;

        if($datum_start == false)
        {
            $datumStart = date("Y-m-d H:i:s");
        }
        if($datum_ende == false)
        {
            $datumEnde = null;
        }

        $data = [
            'schueler_id' => $schueler_id,
            'gegenstand_id' => $gegenstand_id,
            'datum_start' => $datumStart,
            'datum_ende' => $datumEnde,
            'weitere' => $weitere,
            'aktiv'    => $aktiv,
        ];

        $leihtModel = new LeihtModel();

        // Inserts data and returns inserted row's primary key
        $leihtDbId = $leihtModel->insert($data);
---
INSERT INTO `leiht` (`schueler_id`, `gegenstand_id`, `datum_start`, `datum_ende`, `weitere`, `lehrer`, `aktiv`) VALUES ('AGa', 'GEa', '2023-03-03 15:24:58', NULL, 0, '', 1)

    public static function getActiveByIds($schueler_id, $gegenstand_id)
    {
        $leihtModel = new LeihtModel();
        $leiht = $leihtModel->where("schueler_id", $schueler_id)->where('gegenstand_id', $gegenstand_id)->where('aktiv', 1)->First();
---
SELECT *
FROM `leiht`
WHERE `schueler_id` = 'AGa'
AND `gegenstand_id` = 'GEa'
AND `aktiv` = 1
 LIMIT 1

    public static function getActiveByGegenstandId($gegenstand_id)
    {
        $leihtModel = new LeihtModel();
        $leiht = $leihtModel->where("gegenstand_id", $gegenstand_id)->where("aktiv", 1)->First();
---
SELECT *
FROM `leiht`
WHERE `gegenstand_id` = 'ABC-abc-1234'
AND `aktiv` = 1
 LIMIT 1

    public static function getByGegenstandId($gegenstand_id)
    {
        $leihtModel = new LeihtModel();
        $leiht = $leihtModel->where("gegenstand_id", $gegenstand_id)->Find();
---
SELECT *
FROM `leiht`
WHERE `gegenstand_id` = 'ABC-abc-1234'

    public static function getActiveBySchuelerIdDESC($schueler_id)
    {
        $leihtModel = new LeihtModel();
        $leiht = $leihtModel->where("schueler_id", $schueler_id)->where("aktiv", 1)->OrderBy('datum_start', 'DESC')->Find();
---
SELECT *
FROM `leiht`
WHERE `schueler_id` = 'AG5836'
AND `aktiv` = 1

    public static function getBySchuelerId($schueler_id)
    {
        $leihtModel = new LeihtModel();
        $leiht = $leihtModel->where("schueler_id", $schueler_id)->Find();
---
SELECT *
FROM `leiht`
WHERE `schueler_id` = 'AG5836'

    public static function getBySchuelerIdDESC($schueler_id)
    {
        $leihtModel = new LeihtModel();
        $leiht = $leihtModel->where("schueler_id", $schueler_id)->OrderBy('datum_start', 'DESC')->Find();
---
SELECT *
FROM `leiht`
WHERE `schueler_id` = 'AGa'
ORDER BY `datum_start` DESC

    public static function getById($id)
    {
        $leihtModel = new LeihtModel();
        $leiht = $leihtModel->where("id", $id)->First();
---
SELECT *
FROM `leiht`
WHERE `id` = '59'
 LIMIT 1

    public static function getActiveDesc()
    {
        $leihtModel = new LeihtModel();

        $leiht = $leihtModel->where("aktiv", 1)->orderBy("datum_start", "DESC")->FindAll();
---
SELECT *
FROM `leiht`
WHERE `aktiv` = 1
ORDER BY `datum_start` DESC

    public static function getUeberfaellig()
    {
        $leihtModel = new LeihtModel();

        $leiht = $leihtModel->where("aktiv", "1")->FindAll();
---
SELECT *
FROM `leiht`
WHERE `aktiv` = '1'

    public static function getUeberfaelligBySchuelerId($schuelerId)
    {
        $leihtModel = new LeihtModel();

        $leiht = $leihtModel->where("aktiv", "1")->where('schueler_id', $schuelerId)->FindAll();
---
SELECT *
FROM `leiht`
WHERE `aktiv` = '1'
AND `schueler_id` = 'AGa'