app/Libraries/SchuelerHelper.php

SELECT *
FROM `schueler`
---
    public static function getAll()
    {
        $schuelerModel = new SchuelerModel();
        $schueler = $schuelerModel->FindAll();

SELECT *
FROM `schueler`
WHERE `schueler_id` = 'AGa'
 LIMIT 1
---
    public static function getById($id)
    {
        $schuelerModel = new SchuelerModel();
        $schueler = $schuelerModel->where("schueler_id", $id)->First();