app/Libraries/SchuelerHelper.php

    public static function getById($id)
    {
        $schuelerModel = new SchuelerModel();
        $schueler = $schuelerModel->where("schueler_id", $id)->First();
---
SELECT *
FROM `schueler`
WHERE `schueler_id` = 'AGadsf'
 LIMIT 1